load-tests/test.yml
config:
  target: "http://localhost:3000"

  phases:
    - name: "100 request burst"
      duration: 1
      arrivalCount: 100

  defaults:
    headers:
      content-type: "application/json"

  timeout: 60000

scenarios:
  - name: "Burst event-metadata"
    flow:
      - post:
          url: "/v1/lambda/event_metadata"
          json:
            bucket: "lmdevdatabucketlm"
            url: "test_protobuf/drowsy_t_6SS4UIHNLYI7BAAAZ4JIDYDS6A_GrOuO_0008_999DT.pbf.zlib"
            region: "ap-south-1"
            options:
              includePathInfo: true
              includeAnnotationsMetadata: true
              includeInertialSensorData: true